In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
                     'two'],
                  'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
           'baz': [1, 2, 3, 4, 5, 6],
                  'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [4]:
pd.pivot(df,index='foo',columns='bar',values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [5]:
aa=df.pivot(index='foo',columns='bar',values='baz')
aa

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [7]:
aa.index #index :one,two ,name:'foo'

Index(['one', 'two'], dtype='object', name='foo')

In [8]:
aa.columns#iindex:A,B,C ,name:'bar'

Index(['A', 'B', 'C'], dtype='object', name='bar')

In [9]:
aa.index.name

'foo'

In [10]:
aa.columns.name

'bar'

In [11]:
df_a = pd.DataFrame( [[1., 2.], [3., 4.], [5, 6.]],
                   index = ['a', 'c', 'e'], columns = ['Ohio', 'Nevada'])

df_b = pd.DataFrame([[7., 8.], [9., 10.], [11, 12.], [13, 14]],
                   index = ['e', 'c', 'd', 'b'], columns = ['Misouri', 'Alabama'])

In [12]:
df_a

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [13]:
df_b

   Misouri  Alabama
e      7.0      8.0
c      9.0     10.0
d     11.0     12.0
b     13.0     14.0

In [21]:
df_a.join(df_b,how='outer')

   Ohio  Nevada  Misouri  Alabama
a   1.0     2.0      NaN      NaN
b   NaN     NaN     13.0     14.0
c   3.0     4.0      9.0     10.0
d   NaN     NaN     11.0     12.0
e   5.0     6.0      7.0      8.0

In [15]:
df_a.join(df_b,how='inner')

   Ohio  Nevada  Misouri  Alabama
c   3.0     4.0      9.0     10.0
e   5.0     6.0      7.0      8.0

In [16]:
df_a.join(df_b,how='left')

   Ohio  Nevada  Misouri  Alabama
a   1.0     2.0      NaN      NaN
c   3.0     4.0      9.0     10.0
e   5.0     6.0      7.0      8.0

In [17]:
df_a.join(df_b,how='right')

   Ohio  Nevada  Misouri  Alabama
e   5.0     6.0      7.0      8.0
c   3.0     4.0      9.0     10.0
d   NaN     NaN     11.0     12.0
b   NaN     NaN     13.0     14.0

In [18]:
df_a.join(df_b,how='right',sort=True)  #인덱스 바뀜

   Ohio  Nevada  Misouri  Alabama
b   NaN     NaN     13.0     14.0
c   3.0     4.0      9.0     10.0
d   NaN     NaN     11.0     12.0
e   5.0     6.0      7.0      8.0

In [19]:
aa.melt()

  bar  value
0   A      1
1   A      4
2   B      2
3   B      5
4   C      3
5   C      6